app/controllers/subs_controller.rb

  def index
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def show
    @sub = Sub.find_by_id(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT 1  [["id", 1]]